Repository: embar-/pdsa-grapher
Catalog: locale/*/LC_MESSAGES/pdsa-grapher.po
Languages: lt

source: File upload
lt: Rinkmenų įkėlimas

source: Graph
lt: Grafikas

source: Language set to:
lt: Parinkta kalba:

source: PDSA grapher
lt: PDSA graferis

source: Please select PDSA and/or references document!
lt: Pasirinkite PDSA ir/arba ryšių dokumentą!

source: Please select PDSA document sheets!
lt: Pasirinkite PDSA dokumento lakštus!

source: Please select PDSA document and its sheets!
lt: Pasirinkite PDSA dokumentą ir jo lakštus!

source: Please select references columns that contain tables!
lt: Pasirinkite ryšių stulpelius, kuriuose surašytos lentelės!

source: Reference columns for source and target tables are the same!
lt: Stulpelis ryšių pradžių ir pabaigų lentelėms yra vienas ir tas pats!

source: Please select references document sheet!
lt: Pasirinkite ryšių dokumento lakštą!

source: Please select references document!
lt: Pasirinkite ryšių dokumentą!

source: PDSA sheets for tables and columns are the same!
lt: PDSA lakštas lentelėms ir stulpeliams yra vienas ir tas pats!

source: Enhance analysis by selecting from the sheet defining the %s (%s), the column describing the %s.
lt: Analizė bus naudingesnė, jei lakšte, aprašančiame %s („%s“), nurodysite stulpelį, kuriame yra %s.

source: PDSA sheet describing %s (%s) has no data.
lt: PDSA lakšte, aprašančiame %s („%s“) nėra duomenų.

# PDSA sheet describing...
source: tables
lt: lenteles

# pdsa column for
source: tables
lt: lentelės

source: In the PDSA sheet '%s', the column '%s' has unexpected dtype '%s'!
lt: PDSA lakšto „%s“ stulpelio „%s“ tipas „%s“ yra netikėtas!

source: In the PDSA sheet '%s', the column '%s' is empty!
lt: PDSA lakšte „%s“ stulpelis „%s“ yra tuščias!

source: In the PDSA sheet '%s', the column '%s' some values are not strings!
lt: PDSA lakšto „%s“ stulpelyje „%s“ kai kurios reikšmės nėra teksto eilutės!

# PDSA sheet describing...
source: columns
lt: stulpelius

# pdsa column for
source: columns
lt: stulpeliai

source: In the PDSA sheet '%s', the column '%s' values are not strings!
lt: PDSA lakšto „%s“ stulpelyje „%s“ reikšmės nėra teksto eilutės!

source: In the PDSA sheet '%s', the column '%s' values are not unique within '%s'!
lt: PDSA lakšto „%s“ stulpelyje „%s“ reikšmės nėra unikalios grupuojant pagal „%s“!

source: There are no relationships between different tables!
lt: Ryšių tarp skirtingų lentelių nėra!

source: In the references sheet '%s', the column '%s' values are not strings!
lt: Ryšių lakšto „%s“ stulpelyje „%s“ reikšmės nėra teksto eilutės!

source: PDSA sheet '%s' column '%s' has some tables (%d in total) not present in sheet '%s' column '%s', but it's not a problem:
lt: PDSA lakšto „%s“ stulpelyje „%s“ pasitaiko lentelių (iš viso %d), kurių nėra lakšto „%s“ stulpelyje „%s“, bet tai ne bėda:

source: References contain some tables (%d) that are not present in the defined tables:
lt: Ryšiuose pasitaiko lentelių (%d), kurios nebuvo aprašytos PDSA dokumente:

source: Your selected document sheet has no required data.
lt: Jūsų pasirinktame dokumento lakšte nėra reikalingų duomenų.

source: Previously uploaded data
lt: Anksčiau įkelti duomenys

source: (standardized)
lt: (standartiz.)

source: (standardized, shorter)
lt: (stdr., trumpas)

source: You cannot select any table yet.
lt: Dar negalite rinktis lentelių.

source: Please go to the 'File upload' tab, upload the PDSA and/or references document, and select the desired data!
lt: Eikite į „Rinkmenų įkėlimo“ kortelę, įkelkite PDSA ir/arba ryšių dokumentą ir pasirinkite norimus duomenis!

source: No tables were automatically preselected to be displayed in the graph.
lt: Automatiškai neparinkta jokių braižytinų lentelių.

source: You can select tables here.
lt: Lenteles galite pasirinkti čia.

source: Some tables are not displayed in the graph.
lt: Grafike nubraižytos ne visos lentelės.

source: %d of %d
lt: %d iš %d

source: Filter...
lt: Atrinkti…

source: Column references:
lt: Stulpelių jungtys:

source: Columns:
lt: Stulpeliai:

source: Displayed relations:
lt: Parodytieji ryšiai:

source: Not displayed relations:
lt: Neparodytieji ryšiai:

source: Copy tables selected via mouse (no quotes)
lt: Kopijuoti pele pažymėtas lenteles (be ")

source: Copy tables selected via mouse (quoted)
lt: Kopijuoti pele pažymėtas lenteles (su ")

source: Copy displayed tables (no quotes)
lt: Kopijuoti nubraižytas lenteles (be ")

source: Copy displayed tables (quoted)
lt: Kopijuoti nubraižytas lenteles (su ")

source: Copy displayed tables columns (tab sep.)
lt: Kopijuoti nubr. lnt. stulpelius (su tab.)

source: Save displayed tables in JSON
lt: Įrašyti nubraižytas lenteles į JSON

source: Save all tables in JSON
lt: Įrašyti visas lenteles į JSON

source: Show active edge labels
lt: Rodyti užrašus prie aktyvių ryšių

source: Unexpected Cytoscape layout: '%s'. Using default '%s'
lt: Netikėtas Cytoscape išdėstymas „%s“. Naudojamas numatytasis „%s“.

source: Copy table columns selected via mouse (#)
lt: Kopijuoti pele paž. lnt. stulpelius (su #)

source: Save graph as SVG image
lt: Įrašyti kaip SVG paveikslą

source: Import checkbox markings from JSON
lt: Įkelti langelių žymenis iš JSON

source: Show all columns
lt: Rodyti visus stulpelius

source: Show descriptions in graph
lt: Rodyti aprašus brėžinyje

source: Show checkboxes near columns
lt: Rodyti langelius prie stulpelių

source: Show Graphviz DOT syntax
lt: Rodyti Graphviz DOT sintaksę

source: Drag and Drop
lt: Įkelkite

source: Select references sheet:
lt: Pasirinkite ryšių lakštą:

source: Select sheets:
lt: Pasirinkite lakštus:

source: Sheet describing
lt: Lakštas, apibrėžiantis

# From PDSA sheet ... select columns that contain
source: From PDSA sheet describing
lt: Iš lakšto, apibrėžiančio

# From PDSA sheet ... select columns that contain
source: select columns that contain
lt: , pasirinkite stulpelius, kuriuose yra:

source: Select which columns you want to see information for below the graph:
lt: Pasirinkite stulpelius, kuriuos norėtumėte matyti po grafiku:

source: Select...
lt: Pasirinkite...

source: Graph usage instructions
lt: Grafiko naudojimo instrukcija

source: The graph shows the selected tables as nodes and their relationships as lines.
lt: Grafike pasirinktos lentelės vaizduojamos kaip mazgai, o jų ryšiai – linijomis.

source: Relationships are shown if they are described in the references file.
lt: Ryšiai rodomi tik jei aprašyti ryšių rinkmenoje.

source: The graph is interactive:
lt: Grafikas yra interaktyvus:

source: Double-clicking on a node will display the table's metadata in a tooltip:
lt: Dukart spragtelėjus mazgą iškylančiame debesėlyje parodysimi lentelės metaduomenys:

source: columns, their descriptions, displayed relations, and non-displayed relations.
lt: stulpeliai, jų aprašai, parodytieji ryšiai ir neparodytieji ryšiai.

source: Hold the Ctrl key and left-click on nodes to select multiple tables.
lt: Laikydami Vald (Ctrl) klavišą ir spragtelėdami mazgus kairiuoju pelės klavišu, galite pažymėti kelias lenteles.

source: Change filter of drawable tables using keyboard based on the selection made with the mouse:
lt: Galite keisti braižytinų lentelių atranką naudodami klaviatūros klavišus, atsižvelgiant į grafike pele pažymėtas lenteles

source: Delete
lt: Šalinti (Delete)

source: to remove,
lt: pašalinti pažymėtas lenteles,

source: Enter
lt: Įvestis (Enter)

source: to keep only selected tables,
lt: palikti tik pažymėtas lenteles,

source: or
lt: arba

source: to append selected tables (e.g. displayed neighbors).
lt: papildyti pažymėtomis lentelėmis (pvz., rodomais kaimynais).

source: You can move selected nodes by left-clicking on one of them and dragging.
lt: Mazgus galite pertempti į kitą vietą kairiuoju pelės klavišu.

source: The entire graph can be panned by dragging the empty area with the left mouse button.
lt: Visą grafiką galite pertempti kairiuoju pelės klavišu tempdami už tuščios grafiko srities.

source: The view can be zoomed in or out using the mouse wheel.
lt: Mastelį galite keisti sukdami pelės ratuką.

source: Graph instructions
lt: Grafiko instrukcija

source: Filter usage instructions
lt: Atrankos naudojimo instrukcija

source: The graph view depends on your table selection and other configurations.
lt: Grafiko rodinys priklauso nuo pasirinktų lentelių ir kitų parinkčių.

source: For the initial view, up to 10 tables can be automatically preselected based on their metadata and the number of relations - you can change it manually.
lt: Pradiniam rodiniui gali būti automatiškai parinkta iki lentelių pagal jų metaduomenis ir tarpusavio ryšių skaičių – pradinį rodinį galite keisti rankiniu būdu.

source: Graph engine
lt: Braižymo variklis

source: Layout
lt: Išdėstymas

source: Style of the point placement in the graph.
lt: Grafiko taškų išdėstymo stilius.

source: Select tables to graph
lt: Braižytinos lentelės

source: Select tables which relationships you want to display.
lt: Pasirinkimas pavienių lentelių, kurių ryšius norite atvaizduoti.

source: Add list of tables
lt: Rodytinų lentelių papildomas sąrašas

source: You can specify the tables to be displayed as the list; the names of the tables must be separated by commas (space is optional).
lt: Galima nurodyti atvaizduotinas lenteles sąrašu; lentelių pavadinimai turi būt atskirti kableliais (tarpas nebūtinas).

source: This input field also support wildcard characters:
lt: Įvedimo laukas palaiko pakaitos simbolius:

source: matches zero or more of any character;
lt: atitinka jokio arba kelis praleistus simbolius;

source: matches exactly one character.
lt: atitinka bet kokį vieną simbolį.

source: Get neighbours
lt: Rodyti kaimynus

source: Supplement the graph with tables that directly relate to the selected tables; neighbors will be shown with a gray background.
lt: Grafiką papildo lentelėmis, kurios tiesiogiai siejasi su pasirinktomis lentelėmis.

source: Get info about columns of selected tables
lt: Informacija apie pasirinktų lentelių stulpelius

source: Below the graph, displays information about the columns of the selected table(s).
lt: Po grafiku rodo informaciją apie pasirinktos(-ų) lentelės(-ių) stulpelius.

source: Get info on displayed tables
lt: Rodyti info apie nubraižytas lenteles

source: Below the graph, displays the information of the tables drawn in the graph.
lt: Po grafiku rodo grafike atvaizduotų lentelių informaciją.

source: Filter Instructions
lt: Atrankos instrukcija

# pdsa column for
source: records
lt: eilučių skaičius

# pdsa column for
source: comments
lt: aprašymai ar kt. info

# pdsa column for
source: selected
lt: išankstinis parinkimas rodymui

# pdsa column for
source: primary
lt: ar pirminiai raktai

# pdsa column for
source: checkboxes
lt: žymenys Viz grafike

# pdsa column for
source: alias
lt: alt. vardai rodymui Viz grafike

source: Database tables and columns
lt: Duombazės lentelės ir stulpeliai

source: Drag and drop PDSA, JSON or DBML file
lt: Įkelkite PDSA (pvz., pdsa.all_schemas.xlsx, biblioteka_pdsa.xlsx), JSON arba DBML rinkmeną

source: References
lt: Ryšiai

source: Drag and drop references file
lt: Įkelkite ryšių rinkmeną (pvz., sql_2_references.csv, biblioteka_refs.csv)

source: Select columns that contain:
lt: Pasirinkite stulpelius, kuriuose yra:

# references
source: source tables
lt: pradžių („IŠ“) lentelės

# references
source: source columns
lt: pradžių („IŠ“) stulpeliai

# references
source: target tables
lt: galų („Į“) lentelės

# references
source: target columns
lt: galų („Į“) stulpeliai

source: Submit
lt: Pateikti

source: Select
lt: Pasirinkti

# Select tables
source: Automatically
lt: automatiškai

# Select tables
source: Interconnected from refs
lt: ryšių susijungiančias

# Select tables
source: Interconnected from PDSA
lt: PDSA susijungiančias

# Select tables
source: Defined in PDSA
lt: iš PDSA lentelių lakšto

# Select tables
source: All
lt: visas

source: Add list of tables to graph (comma separated)
lt: Rodytinų lentelių papildomas sąrašas (atskirtas kableliu)

source: table1,table2,table3...
lt: lentelė1, lentelė2, lentelė3, ...

# neighbors
source: all
lt: visus

# neighbors
source: source
lt: iš

# neighbors
source: target
lt: į

source: Don't include tables with no records
lt: Neįtraukti lentelių be įrašų

source: Tables depicted in graph:
lt: Grafike atvaizduota lentelių:

source: Unsupported file format
lt: Nepalaikomas rinkmenos formatas

source: Can not detect text encoding
lt: Nepavyko nustatyti teksto koduotės

source: There was an error while processing spreadsheet file
lt: Klaida apdorojant skaičlentės rinkmeną

source: There was an error while processing sheet "%s"
lt: Klaida apdorojant lakštą „%s“

source: There was an error while reading file as JSON
lt: Klaida nuskaitant JSON rinkmeną

source: Unexpected JSON schema
lt: Netikėta JSON schema

source: There was an error while processing file as JSON
lt: Klaida apdorojant rinkmeną tarsi JSON

source: There was an error while processing file as DBML
lt: Klaida apdorojant rinkmeną tarsi DBML

source: There was an error while processing file of unknown type
lt: Klaida apdorojant nežinomo tipo rinkmeną

source: There was an error while processing file as CSV
lt: Klaida apdorojant rinkmeną tarsi CSV

source: DataFrame does not have indicated columns
lt: Lentelėje nėra nurodytų stulpelių

source: Length of old_columns differ from new_columns.
lt: Skiriasi senų ir naujų stulpelių ilgis.
